In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [30]:
# ser[0], ser['a']
ser.iloc[0],ser.loc['a']

(np.int64(1), np.int64(1))

In [10]:
dic = {'a':1, 'b':2,'c':3}
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

In [15]:
ser2 = pd.Series([10, "apple"])
ser2

0       10
1    apple
dtype: object

In [ ]:
population = pd.Series([9776, 2729, 1566, 3158],
                       index=['서울', '부산', '인천', '대구'])
population[['서울', '부산']] #0,1 팬시인덱싱

서울    9776
부산    2729
dtype: int64

In [24]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [3]:
scientists = pd.DataFrame({
                         "Name": ["Rosaline Franklin", "William Gosset"],
                         "Occupation": ["Chemist", "Statistician"],
                         "Born": ["1920-07-25", "1876-06-13"],
                         "Died": ["1958-04-16", "1937-10-16"],
                         "Age": [37, 61],
                         })

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [39]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [51]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline, dtype: object

In [4]:
scientists.index = ['Rosaline', "William"]

In [5]:
scientists.loc['Rosaline', 'Name']

'Rosaline Franklin'

In [6]:
# [시작행:끝행, 시작열:끝열] 쉼표는 행과열 > 차원을 구분
scientists.iloc[:,0:2]

                       Name    Occupation
Rosaline  Rosaline Franklin       Chemist
William      William Gosset  Statistician

In [55]:
data = [[1,2,3],[4,5,6],[7,8,9]]
dt = pd.DataFrame(data)
dt.iloc[0][1]

np.int64(2)

In [58]:
dt = pd.DataFrame(data, columns=['A','B','C'])
dt.iloc[1]['C']

np.int64(6)

In [7]:
sci1 = pd.DataFrame({
                    "Name": ["Rosaline Franklin", "William Gosset"],
                    "Occupation": ["Chemist", "Statistician"],
                    "Born": ["1920-07-25", "1876-06-13"],
                    "Died": ["1958-04-16", "1937-10-16"],
                    "Age": [37, 61],
                    })

In [60]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [ ]:
sci1.loc[0, 'Occupation']#[row, col] 인덱싱

'Chemist'

In [ ]:
#"William Gosset"의 나이
sci1.iloc[1,4]

np.int64(61)

In [9]:
#born, died 만 추출
sci1.iloc[:,2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [13]:
#occupation만 추출
sci1.loc[:,"Occupation"]

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [65]:
sci1.to_csv('./data/scientist_1.csv')

In [66]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [67]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [68]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [70]:
# pickle : 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientist.pickle')

In [71]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 데이터 미리보기
1. info()
2. head()/tail()

In [73]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [76]:
df1.head(3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [77]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [79]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [87]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [14]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [95]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [96]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [97]:
df.dtypes

이름    object
나이     int64
점수     int64
dtype: object

In [16]:
df.columns = ['name', 'age', 'score']
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
c  박민수   22     78
d  정수진   31     95
e  최영호   27     88
f  한미래   24     73
g  윤지원   29     91

In [29]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [30]:
#일부 열의 이름 변경
df1 = df.rename(columns={'name':'Name', 'age':'Age'})
#일부 행의 이름 소문자 변경
# df.rename(index={'A':'a'},inplace=True)
# df
df2 = df1.rename(index={'A':'a'})
df2

  Name  Age  score
a  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

# 행 / 열 추가

In [58]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [ ]:
df[df['나이'] > 25] #조건을 사용한 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [33]:
df[df['점수']>=90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [59]:
df.loc[7] = ["홍길동", 30, 70]
# df.iloc[8] = ["김길동",20,99] #iloc는 추가는 안되고 변경만 가능함
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [121]:
# 열 추가
df['grade'] = ['B','A','C','A','B','C','A','C']
df

    이름  학생번호  나이  점수 등급 grade
0  김철수  S001  25  85  B     B
1  이영희  S002  28  92  A     A
2  박민수  S003  22  78  C     C
3  정수진  S004  31  95  A     A
4  최영호  S005  27  88  B     B
5  한미래  S006  24  73  C     C
6  윤지원  S007  29  91  A     A
7  홍길동  S008  30  70  C     C

In [122]:
#열 이름 등급으로 변경
df.rename(columns={'grade':'등급'}, inplace=True)
df

    이름  학생번호  나이  점수 등급 등급
0  김철수  S001  25  85  B  B
1  이영희  S002  28  92  A  A
2  박민수  S003  22  78  C  C
3  정수진  S004  31  95  A  A
4  최영호  S005  27  88  B  B
5  한미래  S006  24  73  C  C
6  윤지원  S007  29  91  A  A
7  홍길동  S008  30  70  C  C

In [120]:
df.insert(loc=1,column='학생번호',value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'])
df

ValueError: cannot insert 학생번호, already exists

In [73]:
# df1 = df.drop('grade',axis=1) #inplace 속성을 쓸 수 있음
# df = df1
df

    이름  학생번호  나이  점수 등급 등급
0  김철수  S001  25  85  B  B
1  이영희  S002  28  92  A  A
2  박민수  S003  22  78  C  C
3  정수진  S004  31  95  A  A
4  최영호  S005  27  88  B  B
5  한미래  S006  24  73  C  C
6  윤지원  S007  29  91  A  A
7  홍길동  S008  30  70  C  C

In [102]:
col_keep = [i for i in range(len(df.columns)) if i != 4]
df = df.iloc[:,col_keep]
df

    이름  학생번호  나이  점수 등급
0  김철수  S001  25  85  B
1  이영희  S002  28  92  A
2  박민수  S003  22  78  C
3  정수진  S004  31  95  A
4  최영호  S005  27  88  B
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
7  홍길동  S008  30  70  C

In [124]:
#중복 컬럼 제거
df = df.loc[:, ~df.columns.duplicated()]
df

    이름  학생번호  나이  점수 등급
0  김철수  S001  25  85  B
1  이영희  S002  28  92  A
2  박민수  S003  22  78  C
3  정수진  S004  31  95  A
4  최영호  S005  27  88  B
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
7  홍길동  S008  30  70  C

In [112]:
df.astype({'점수':float})

    이름  학생번호  나이    점수 등급
0  김철수  S001  25  85.0  B
1  이영희  S002  28  92.0  A
2  박민수  S003  22  78.0  C
3  정수진  S004  31  95.0  A
4  최영호  S005  27  88.0  B
5  한미래  S006  24  73.0  C
6  윤지원  S007  29  91.0  A
7  홍길동  S008  30  70.0  C

In [125]:
df.index

Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [128]:
df_new = df.set_index('학생번호')
df_new.index

Index(['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='학생번호')

In [129]:
df_new.reset_index(inplace=True)
df_new

   학생번호   이름  나이  점수 등급
0  S001  김철수  25  85  B
1  S002  이영희  28  92  A
2  S003  박민수  22  78  C
3  S004  정수진  31  95  A
4  S005  최영호  27  88  B
5  S006  한미래  24  73  C
6  S007  윤지원  29  91  A
7  S008  홍길동  30  70  C

In [139]:
dr = pd.date_range('2025-06-01',periods=8)
dr

DatetimeIndex(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
               '2025-06-05', '2025-06-06', '2025-06-07', '2025-06-08'],
              dtype='datetime64[ns]', freq='D')

In [148]:
pd.date_range('2025-06-01',periods=5,freq='2D') # 2일 간격

DatetimeIndex(['2025-06-01', '2025-06-03', '2025-06-05', '2025-06-07',
               '2025-06-09'],
              dtype='datetime64[ns]', freq='2D')

In [140]:
df_new['날짜'] = dr
df_new

   학생번호   이름  나이  점수 등급         날짜
0  S001  김철수  25  85  B 2025-06-01
1  S002  이영희  28  92  A 2025-06-02
2  S003  박민수  22  78  C 2025-06-03
3  S004  정수진  31  95  A 2025-06-04
4  S005  최영호  27  88  B 2025-06-05
5  S006  한미래  24  73  C 2025-06-06
6  S007  윤지원  29  91  A 2025-06-07
7  S008  홍길동  30  70  C 2025-06-08

In [141]:
df_new1 = df_new.set_index('날짜')
df_new1

            학생번호   이름  나이  점수 등급
날짜
2025-06-01  S001  김철수  25  85  B
2025-06-02  S002  이영희  28  92  A
2025-06-03  S003  박민수  22  78  C
2025-06-04  S004  정수진  31  95  A
2025-06-05  S005  최영호  27  88  B
2025-06-06  S006  한미래  24  73  C
2025-06-07  S007  윤지원  29  91  A
2025-06-08  S008  홍길동  30  70  C

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학생번호    8 non-null      object
 2   나이      8 non-null      int64
 3   점수      8 non-null      int64
 4   등급      8 non-null      object
dtypes: int64(2), object(3)
memory usage: 684.0+ bytes

In [131]:
df.head(3)

    이름  학생번호  나이  점수 등급
0  김철수  S001  25  85  B
1  이영희  S002  28  92  A
2  박민수  S003  22  78  C

In [132]:
df.tail(3)

    이름  학생번호  나이  점수 등급
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
7  홍길동  S008  30  70  C

In [134]:
df.loc[:,'점수'].describe()

count     8.00000
mean     84.00000
std       9.28901
min      70.00000
25%      76.75000
50%      86.50000
75%      91.25000
max      95.00000
Name: 점수, dtype: float64

In [142]:
#data/gapminder.tsv 를 읽어 데이터 프레임 만들기
df3 = pd.read_csv('./data/gapminder.tsv', sep='\t')

In [ ]:
#미리보기
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [102]:
df3.head(3)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [103]:
df3.tail(3)

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [149]:
df3.loc[:,'lifeExp'].describe()

count    1704.000000
mean       59.474439
std        12.917107
min        23.599000
25%        48.198000
50%        60.712500
75%        70.845500
max        82.603000
Name: lifeExp, dtype: float64

In [ ]:
#country 열 추출하기
# df3.loc[:,'country']
df3['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [153]:
#'country', 'continent', 'year' 열 추출하기
# df3.loc[:,['country', 'continent', 'year']]
df3[['country', 'continent', 'year']]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [110]:
#[0], [99] , [-1] 행을 각각 추출하기
df3.iloc[[0,99,-1]]

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
99     Bangladesh      Asia  1967   43.453  62821884  721.186086
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [156]:
df3[df3['country'] == 'Korea, Rep.']

         country continent  year  lifeExp       pop     gdpPercap
840  Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841  Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842  Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843  Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844  Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845  Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846  Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847  Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848  Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849  Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850  Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851  Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [157]:
# 연도와 인구 10건 > 슬라이싱 > 서브셋

df3.loc[0:10,['year','pop']]

    year       pop
0   1952   8425333
1   1957   9240934
2   1962  10267083
3   1967  11537966
4   1972  13079460
5   1977  14880372
6   1982  12881816
7   1987  13867957
8   1992  16317921
9   1997  22227415
10  2002  25268405

In [168]:
#인구당gdp 마지막 10개 값 추출
df3.loc[len(df3) - 10:,'gdpPercap']

1694    527.272182
1695    569.795071
1696    799.362176
1697    685.587682
1698    788.855041
1699    706.157306
1700    693.420786
1701    792.449960
1702    672.038623
1703    469.709298
Name: gdpPercap, dtype: float64

In [ ]:
#range() 객체로 행/열 슬라이싱
df3.iloc[range(10,20),range(0,3)]

        country continent  year
10  Afghanistan      Asia  2002
11  Afghanistan      Asia  2007
12      Albania    Europe  1952
13      Albania    Europe  1957
14      Albania    Europe  1962
15      Albania    Europe  1967
16      Albania    Europe  1972
17      Albania    Europe  1977
18      Albania    Europe  1982
19      Albania    Europe  1987